ATsupportum/src/InformationRegisters/ДоступностьМетокКлиентам_ат/ДоступностьМетокКлиентам_ат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДоступностьМетокКлиентам_ат</name>
  <resources>
    <name>Просмотр</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Редактирование</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты_ат</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ГруппаМеток</name>
    <type>
      <types>CatalogRef.Метки_ат</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ATsupportum/src/InformationRegisters/СпецификацияПользователей_ат/СпецификацияПользователей_ат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СпецификацияПользователей_ат</name>
  <comment>TODO - ren</comment>
  <resources>
    <name>ФамилияИО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Должность</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПолучатьУведомления</name>
    <comment>TODO - либо использовать, либо удалить</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Основной</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПостоянныйPIN</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Пользователь</name>
    <comment>TODO - ren</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <comment>TODO - ren</comment>
    <type>
      <types>CatalogRef.Контрагенты_ат</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ПодразделенияКлиентов_ат</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ATsupportum/src/InformationRegisters/ДоступностьМетокКлиентам_ат/Forms/ФормаЗаписи/Module.bsl
&НаКлиенте
Процедура РедактированиеПриИзменении(Элемент)
	
	Если Запись.Редактирование Тогда
		Запись.Просмотр = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСвязиПараметровВыбораПользователя()
	
	Если ЗначениеЗаполнено(Запись.Клиент) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	СпецификацияПользователей_ат.Пользователь
		|ИЗ
		|	РегистрСведений.СпецификацияПользователей_ат КАК СпецификацияПользователей_ат
		|ГДЕ
		|	СпецификацияПользователей_ат.Контрагент = &Контрагент";
		Запрос.УстановитьПараметр("Контрагент", Запись.Клиент);
		
		ПользователиПоКлиенту.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Пользователь"));
		
		НоваяСвязь = Новый СвязьПараметраВыбора("Отбор.Ссылка", "ПользователиПоКлиенту");
		НовыйМассив = Новый Массив();
		НовыйМассив.Добавить(НоваяСвязь);
		НовыеСвязи = Новый ФиксированныйМассив(НовыйМассив);
		Элементы.Пользователь.СвязиПараметровВыбора = НовыеСвязи;
		
	Иначе
		
		Элементы.Пользователь.СвязиПараметровВыбора = Новый ФиксированныйМассив(Новый Массив);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КлиентПриИзменении(Элемент)
	
	ЗаполнитьСвязиПараметровВыбораПользователя();
	
КонецПроцедуры

&НаКлиенте
Процедура ПросмотрПриИзменении(Элемент)
	
	Если НЕ Запись.Просмотр Тогда
		Запись.Редактирование = Ложь;
	КонецЕсли;
	
КонецПроцедуры
